#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-ufwgav2zprjdgapp]
aws_security_group_rule.egress: Refreshing state... [id=sgrule-946088648]
aws_security_group_rule.ingress: Refreshing state... [id=sgrule-259871307]
aws_kms_key.app_4_key: Refreshing state... [id=4b7905a0-b2d6-46dd-9db8-d1211429cda3]
aws_vpc.this: Refreshing state... [id=vpc-03206654adef9668d]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-4/log]
aws_kms_alias.key: Refreshing state... [id=alias/app-4]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=4b7905a0-b2d6-46dd-9db8-d1211429cda3]
aws_ecr_repository.image_repo: Refreshing state... [id=app-4]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-4]
aws_default_security_group.default: Refreshing state... [id=sg-0301b1a7a7f0fbb71]
aws_subnet.public[1]: Refreshing state... [id=subnet-01f9a40b6742fd3f0]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0efc85be3815d6528]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bb01ac720ac24033]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-4/244974b204720e0a]
aws_route_table.this_rt: Refreshing state... [id=rtb-09d7b5f268b4069b3]
aws_security_group.custom_sg: Refreshing state... [id=sg-07243a7140b9304f9]
aws_route.internet_route: Refreshing state... [id=r-rtb-09d7b5f268b4069b31080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04ec8925791ee27cb]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0397781f9956e732b]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-4/4d2d587ec3b42d82]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-4/4d2d587ec3b42d82/442e1e58b9e80242]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route_table.this_rt_private will be created
  + resource "aws_route_table" "this_rt_private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app-4-route-table-private"
        }
      + tags_all         = {
          + "Name"   = "app-4-route-table-private"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_id           = "vpc-03206654adef9668d"
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.endpoint-sg will be created
  + resource "aws_security_group" "endpoint-sg" {
      + arn                    = (known after apply)
      + description            = "allow inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "endpoint_access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-5-endpoint-sg"
        }
      + tags_all               = {
          + "Name"   = "app-5-endpoint-sg"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_id                 = "vpc-03206654adef9668d"
    }

  # aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "allow traffic to reach outside the vpc" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-946088648" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-07243a7140b9304f9" -> null
      - security_group_rule_id = "sgr-0907249753af516b4" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "egress" -> null
    }

  # aws_security_group_rule.egress_load_balancer will be created
  + resource "aws_security_group_rule" "egress_load_balancer" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "allow traffic to reach outside the vpc"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07243a7140b9304f9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress will be destroyed
  # (because aws_security_group_rule.ingress is not in configuration)
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "allow traffic into the load balancer" -> null
      - from_port              = 8080 -> null
      - id                     = "sgrule-259871307" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-07243a7140b9304f9" -> null
      - security_group_rule_id = "sgr-03a6aa1edcae8598b" -> null
      - self                   = false -> null
      - to_port                = 8080 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.ingress_load_balancer will be created
  + resource "aws_security_group_rule" "ingress_load_balancer" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "allow traffic into the load balancer"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07243a7140b9304f9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress_vpc_endpoint will be created
  + resource "aws_security_group_rule" "ingress_vpc_endpoint" {
      + cidr_blocks              = [
          + "11.90.30.0/25",
        ]
      + description              = "Enable access for the endpoints."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07243a7140b9304f9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "11.90.30.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "app-4-private-1"
        }
      + tags_all                                       = {
          + "Name"   = "app-4-private-1"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_id                                         = "vpc-03206654adef9668d"
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "11.90.30.96/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "app-4-private-2"
        }
      + tags_all                                       = {
          + "Name"   = "app-4-private-2"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_id                                         = "vpc-03206654adef9668d"
    }

  # aws_vpc_endpoint.cloudwatch will be created
  + resource "aws_vpc_endpoint" "cloudwatch" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-4-logs"
        }
      + tags_all              = {
          + "Name"   = "app-4-logs"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03206654adef9668d"
    }

  # aws_vpc_endpoint.ecr will be created
  + resource "aws_vpc_endpoint" "ecr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-4-ecr"
        }
      + tags_all              = {
          + "Name"   = "app-4-ecr"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03206654adef9668d"
    }

  # aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-4-ecr-api"
        }
      + tags_all              = {
          + "Name"   = "app-4-ecr-api"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03206654adef9668d"
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "app-4-s3"
        }
      + tags_all              = {
          + "Name"   = "app-4-s3"
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-03206654adef9668d"
    }

  # aws_vpc_endpoint_route_table_association.s3_association will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_association" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

Plan: 14 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*